БылковД.А_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</name>
  <basedOn>Document.ИндивидуальныйПланЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ТекущийСтатусЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
</mdclass:Document>

БылковД.А_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Дата,
	|	ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Дисциплина,
	|	ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.НаименованиеКонтроля,
	|	ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Номер,
	|	ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Оценка,
	|	ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Преподаватель,
	|	ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.СтатусАкадемическойЗадолженности,
	|	ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Студент
	|ИЗ
	|	Документ.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ КАК ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ
	|ГДЕ
	|	ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
